; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite1 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite2 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	satellite3 - satellite
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	instrument25 - instrument
	satellite4 - satellite
	instrument26 - instrument
	instrument27 - instrument
	instrument28 - instrument
	instrument29 - instrument
	instrument30 - instrument
	instrument31 - instrument
	satellite5 - satellite
	instrument32 - instrument
	instrument33 - instrument
	instrument34 - instrument
	satellite6 - satellite
	instrument35 - instrument
	instrument36 - instrument
	instrument37 - instrument
	instrument38 - instrument
	instrument39 - instrument
	instrument40 - instrument
	instrument41 - instrument
	thermograph7 - mode
	thermograph5 - mode
	spectrograph1 - mode
	thermograph6 - mode
	infrared3 - mode
	spectrograph2 - mode
	image4 - mode
	image0 - mode
	star5 - direction
	groundstation10 - direction
	groundstation16 - direction
	star7 - direction
	star18 - direction
	groundstation15 - direction
	star11 - direction
	star13 - direction
	star0 - direction
	star1 - direction
	groundstation4 - direction
	star9 - direction
	groundstation2 - direction
	star6 - direction
	star17 - direction
	groundstation14 - direction
	groundstation19 - direction
	groundstation8 - direction
	star12 - direction
	groundstation3 - direction
	phenomenon20 - direction
	phenomenon21 - direction
	planet22 - direction
	star23 - direction
	phenomenon24 - direction
	planet25 - direction
	planet26 - direction
	planet27 - direction
	planet28 - direction
	phenomenon29 - direction
	planet30 - direction
	star31 - direction
	phenomenon32 - direction
	phenomenon33 - direction
	star34 - direction
	planet35 - direction
	phenomenon36 - direction
	phenomenon37 - direction
	phenomenon38 - direction
	phenomenon39 - direction
	phenomenon40 - direction
	star41 - direction
	planet42 - direction
	planet43 - direction
	planet44 - direction
	phenomenon45 - direction
	phenomenon46 - direction
	planet47 - direction
	planet48 - direction
	star49 - direction
)
(:init
	(supports instrument0 thermograph6)
	(calibration_target instrument0 star12)
	(calibration_target instrument0 star18)
	(calibration_target instrument0 star7)
	(calibration_target instrument0 star17)
	(calibration_target instrument0 star11)
	(calibration_target instrument0 groundstation4)
	(supports instrument1 image0)
	(calibration_target instrument1 groundstation2)
	(calibration_target instrument1 star5)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 groundstation8)
	(supports instrument3 thermograph5)
	(supports instrument3 thermograph7)
	(calibration_target instrument3 star17)
	(calibration_target instrument3 star1)
	(calibration_target instrument3 groundstation10)
	(calibration_target instrument3 star11)
	(supports instrument4 thermograph6)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 star12)
	(calibration_target instrument4 groundstation10)
	(calibration_target instrument4 groundstation19)
	(calibration_target instrument4 star17)
	(supports instrument5 thermograph7)
	(calibration_target instrument5 groundstation15)
	(calibration_target instrument5 star17)
	(calibration_target instrument5 star1)
	(calibration_target instrument5 star11)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared3)
	(supports instrument6 image0)
	(calibration_target instrument6 groundstation8)
	(calibration_target instrument6 groundstation14)
	(calibration_target instrument6 star11)
	(calibration_target instrument6 groundstation3)
	(calibration_target instrument6 star18)
	(calibration_target instrument6 groundstation10)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 groundstation2)
	(calibration_target instrument7 groundstation19)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(on_board instrument5 satellite0)
	(on_board instrument6 satellite0)
	(on_board instrument7 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet30)
	(supports instrument8 infrared3)
	(calibration_target instrument8 groundstation14)
	(calibration_target instrument8 groundstation19)
	(supports instrument9 image0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 star5)
	(calibration_target instrument9 groundstation2)
	(calibration_target instrument9 groundstation10)
	(calibration_target instrument9 groundstation14)
	(supports instrument10 thermograph6)
	(supports instrument10 thermograph7)
	(calibration_target instrument10 star17)
	(calibration_target instrument10 groundstation3)
	(calibration_target instrument10 groundstation10)
	(calibration_target instrument10 star18)
	(calibration_target instrument10 groundstation4)
	(supports instrument11 thermograph7)
	(calibration_target instrument11 star9)
	(calibration_target instrument11 star5)
	(on_board instrument8 satellite1)
	(on_board instrument9 satellite1)
	(on_board instrument10 satellite1)
	(on_board instrument11 satellite1)
	(power_avail satellite1)
	(pointing satellite1 star9)
	(supports instrument12 thermograph5)
	(calibration_target instrument12 groundstation10)
	(calibration_target instrument12 groundstation15)
	(calibration_target instrument12 star13)
	(calibration_target instrument12 groundstation8)
	(calibration_target instrument12 star5)
	(supports instrument13 thermograph7)
	(calibration_target instrument13 star18)
	(supports instrument14 thermograph5)
	(supports instrument14 image4)
	(supports instrument14 image0)
	(calibration_target instrument14 star18)
	(calibration_target instrument14 groundstation15)
	(calibration_target instrument14 groundstation4)
	(supports instrument15 infrared3)
	(supports instrument15 thermograph7)
	(calibration_target instrument15 groundstation15)
	(calibration_target instrument15 star1)
	(calibration_target instrument15 star6)
	(calibration_target instrument15 groundstation16)
	(supports instrument16 infrared3)
	(supports instrument16 spectrograph1)
	(calibration_target instrument16 groundstation16)
	(calibration_target instrument16 star12)
	(calibration_target instrument16 star17)
	(calibration_target instrument16 groundstation10)
	(calibration_target instrument16 groundstation15)
	(supports instrument17 image0)
	(supports instrument17 infrared3)
	(calibration_target instrument17 star18)
	(calibration_target instrument17 groundstation8)
	(calibration_target instrument17 groundstation10)
	(calibration_target instrument17 star11)
	(calibration_target instrument17 groundstation19)
	(supports instrument18 spectrograph1)
	(calibration_target instrument18 groundstation19)
	(calibration_target instrument18 star12)
	(supports instrument19 thermograph5)
	(supports instrument19 spectrograph1)
	(calibration_target instrument19 star6)
	(calibration_target instrument19 groundstation2)
	(on_board instrument12 satellite2)
	(on_board instrument13 satellite2)
	(on_board instrument14 satellite2)
	(on_board instrument15 satellite2)
	(on_board instrument16 satellite2)
	(on_board instrument17 satellite2)
	(on_board instrument18 satellite2)
	(on_board instrument19 satellite2)
	(power_avail satellite2)
	(pointing satellite2 groundstation16)
	(supports instrument20 thermograph5)
	(calibration_target instrument20 groundstation14)
	(calibration_target instrument20 star18)
	(calibration_target instrument20 star13)
	(calibration_target instrument20 star1)
	(calibration_target instrument20 star11)
	(calibration_target instrument20 groundstation15)
	(supports instrument21 infrared3)
	(supports instrument21 thermograph7)
	(supports instrument21 thermograph5)
	(calibration_target instrument21 groundstation14)
	(calibration_target instrument21 star0)
	(calibration_target instrument21 groundstation2)
	(calibration_target instrument21 star18)
	(calibration_target instrument21 star11)
	(supports instrument22 thermograph7)
	(supports instrument22 spectrograph1)
	(calibration_target instrument22 groundstation2)
	(calibration_target instrument22 groundstation10)
	(calibration_target instrument22 star18)
	(calibration_target instrument22 groundstation4)
	(supports instrument23 thermograph6)
	(supports instrument23 image0)
	(supports instrument23 spectrograph2)
	(calibration_target instrument23 star18)
	(supports instrument24 thermograph7)
	(calibration_target instrument24 groundstation3)
	(calibration_target instrument24 groundstation16)
	(calibration_target instrument24 star6)
	(supports instrument25 thermograph5)
	(supports instrument25 image0)
	(supports instrument25 spectrograph2)
	(calibration_target instrument25 groundstation8)
	(calibration_target instrument25 star9)
	(calibration_target instrument25 star6)
	(calibration_target instrument25 groundstation14)
	(calibration_target instrument25 groundstation16)
	(calibration_target instrument25 star17)
	(on_board instrument20 satellite3)
	(on_board instrument21 satellite3)
	(on_board instrument22 satellite3)
	(on_board instrument23 satellite3)
	(on_board instrument24 satellite3)
	(on_board instrument25 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon37)
	(supports instrument26 thermograph6)
	(calibration_target instrument26 groundstation2)
	(calibration_target instrument26 star11)
	(calibration_target instrument26 star13)
	(calibration_target instrument26 groundstation10)
	(calibration_target instrument26 groundstation19)
	(calibration_target instrument26 groundstation3)
	(supports instrument27 image0)
	(supports instrument27 thermograph7)
	(supports instrument27 spectrograph2)
	(calibration_target instrument27 star6)
	(calibration_target instrument27 star17)
	(calibration_target instrument27 star5)
	(calibration_target instrument27 groundstation10)
	(calibration_target instrument27 groundstation3)
	(calibration_target instrument27 star0)
	(supports instrument28 thermograph5)
	(calibration_target instrument28 groundstation8)
	(calibration_target instrument28 groundstation3)
	(calibration_target instrument28 star1)
	(calibration_target instrument28 groundstation2)
	(calibration_target instrument28 groundstation16)
	(supports instrument29 spectrograph2)
	(supports instrument29 thermograph5)
	(calibration_target instrument29 star12)
	(calibration_target instrument29 star1)
	(calibration_target instrument29 star11)
	(calibration_target instrument29 groundstation10)
	(calibration_target instrument29 groundstation8)
	(calibration_target instrument29 groundstation14)
	(supports instrument30 spectrograph1)
	(supports instrument30 image4)
	(calibration_target instrument30 star12)
	(calibration_target instrument30 groundstation16)
	(calibration_target instrument30 groundstation3)
	(calibration_target instrument30 groundstation4)
	(calibration_target instrument30 groundstation19)
	(calibration_target instrument30 star7)
	(supports instrument31 spectrograph1)
	(supports instrument31 thermograph6)
	(calibration_target instrument31 groundstation3)
	(calibration_target instrument31 star7)
	(calibration_target instrument31 star0)
	(calibration_target instrument31 groundstation4)
	(calibration_target instrument31 groundstation15)
	(on_board instrument26 satellite4)
	(on_board instrument27 satellite4)
	(on_board instrument28 satellite4)
	(on_board instrument29 satellite4)
	(on_board instrument30 satellite4)
	(on_board instrument31 satellite4)
	(power_avail satellite4)
	(pointing satellite4 groundstation19)
	(supports instrument32 image4)
	(supports instrument32 spectrograph2)
	(calibration_target instrument32 star9)
	(calibration_target instrument32 groundstation2)
	(calibration_target instrument32 groundstation19)
	(calibration_target instrument32 star13)
	(supports instrument33 image0)
	(calibration_target instrument33 groundstation19)
	(supports instrument34 image0)
	(supports instrument34 infrared3)
	(supports instrument34 thermograph7)
	(calibration_target instrument34 groundstation15)
	(calibration_target instrument34 groundstation8)
	(calibration_target instrument34 star18)
	(on_board instrument32 satellite5)
	(on_board instrument33 satellite5)
	(on_board instrument34 satellite5)
	(power_avail satellite5)
	(pointing satellite5 phenomenon20)
	(supports instrument35 image0)
	(calibration_target instrument35 star6)
	(calibration_target instrument35 star11)
	(calibration_target instrument35 star1)
	(supports instrument36 thermograph7)
	(calibration_target instrument36 groundstation8)
	(calibration_target instrument36 groundstation19)
	(supports instrument37 infrared3)
	(supports instrument37 spectrograph1)
	(supports instrument37 thermograph5)
	(calibration_target instrument37 groundstation8)
	(calibration_target instrument37 star1)
	(calibration_target instrument37 star0)
	(calibration_target instrument37 star13)
	(calibration_target instrument37 groundstation14)
	(supports instrument38 infrared3)
	(calibration_target instrument38 groundstation4)
	(calibration_target instrument38 star12)
	(calibration_target instrument38 groundstation8)
	(calibration_target instrument38 star17)
	(calibration_target instrument38 groundstation14)
	(supports instrument39 infrared3)
	(calibration_target instrument39 groundstation8)
	(calibration_target instrument39 groundstation19)
	(calibration_target instrument39 groundstation2)
	(calibration_target instrument39 star12)
	(calibration_target instrument39 groundstation3)
	(calibration_target instrument39 star9)
	(supports instrument40 spectrograph2)
	(supports instrument40 infrared3)
	(supports instrument40 thermograph6)
	(calibration_target instrument40 star17)
	(calibration_target instrument40 star6)
	(supports instrument41 image0)
	(supports instrument41 image4)
	(calibration_target instrument41 groundstation3)
	(calibration_target instrument41 star12)
	(calibration_target instrument41 groundstation8)
	(calibration_target instrument41 groundstation19)
	(calibration_target instrument41 groundstation14)
	(on_board instrument35 satellite6)
	(on_board instrument36 satellite6)
	(on_board instrument37 satellite6)
	(on_board instrument38 satellite6)
	(on_board instrument39 satellite6)
	(on_board instrument40 satellite6)
	(on_board instrument41 satellite6)
	(power_avail satellite6)
	(pointing satellite6 phenomenon29)
)
(:goal (and
	(have_image phenomenon20 spectrograph1)
	(have_image phenomenon20 thermograph6)
	(have_image phenomenon21 thermograph5)
	(have_image planet22 thermograph6)
	(have_image planet22 spectrograph2)
	(have_image star23 spectrograph1)
	(have_image phenomenon24 spectrograph1)
	(have_image planet26 spectrograph1)
	(have_image planet26 infrared3)
	(have_image planet28 image4)
	(have_image planet28 spectrograph1)
	(have_image phenomenon29 thermograph5)
	(have_image planet30 spectrograph2)
	(have_image planet30 infrared3)
	(have_image star31 image0)
	(have_image phenomenon32 thermograph5)
	(have_image phenomenon32 spectrograph2)
	(have_image phenomenon33 spectrograph2)
	(have_image star34 thermograph5)
	(have_image planet35 spectrograph2)
	(have_image phenomenon36 thermograph7)
	(have_image phenomenon36 thermograph5)
	(have_image phenomenon37 thermograph5)
	(have_image phenomenon37 infrared3)
	(have_image phenomenon38 image0)
	(have_image phenomenon38 thermograph6)
	(have_image phenomenon39 thermograph7)
	(have_image phenomenon40 spectrograph2)
	(have_image phenomenon40 thermograph6)
	(have_image star41 infrared3)
	(have_image planet42 spectrograph2)
	(have_image planet43 spectrograph1)
	(have_image planet44 thermograph6)
	(have_image planet44 thermograph5)
	(have_image phenomenon45 thermograph6)
	(have_image phenomenon46 spectrograph1)
	(have_image phenomenon46 thermograph5)
	(have_image planet47 image4)
	(have_image planet48 image4)
	(have_image star49 image0)
))
(:metric minimize (total-time))

)

; plan
1. (switch_on instrument16 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument16)
   goals met: 0 of 40
2. (calibrate satellite2 instrument16 groundstation16)
   added: (calibrated instrument16)
   goals met: 0 of 40
3. (turn_to satellite2 phenomenon20 groundstation16)
   deleted: (pointing satellite2 groundstation16)
   added: (pointing satellite2 phenomenon20)
   goals met: 0 of 40
4. (take_image satellite2 phenomenon20 instrument16 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 1 of 40
5. (switch_on instrument26 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument26)
   goals met: 1 of 40
6. (calibrate satellite4 instrument26 groundstation19)
   added: (calibrated instrument26)
   goals met: 1 of 40
7. (turn_to satellite4 phenomenon20 groundstation19)
   deleted: (pointing satellite4 groundstation19)
   added: (pointing satellite4 phenomenon20)
   goals met: 1 of 40
8. (take_image satellite4 phenomenon20 instrument26 thermograph6)
   added: (have_image phenomenon20 thermograph6)
   goals met: 2 of 40
9. (switch_on instrument25 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument25)
   goals met: 2 of 40
10. (turn_to satellite3 star17 phenomenon37)
   deleted: (pointing satellite3 phenomenon37)
   added: (pointing satellite3 star17)
   goals met: 2 of 40
11. (calibrate satellite3 instrument25 star17)
   added: (calibrated instrument25)
   goals met: 2 of 40
12. (turn_to satellite3 phenomenon21 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 phenomenon21)
   goals met: 2 of 40
13. (take_image satellite3 phenomenon21 instrument25 thermograph5)
   added: (have_image phenomenon21 thermograph5)
   goals met: 3 of 40
14. (turn_to satellite2 phenomenon24 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 phenomenon24)
   goals met: 3 of 40
15. (take_image satellite2 phenomenon24 instrument16 spectrograph1)
   added: (have_image phenomenon24 spectrograph1)
   goals met: 4 of 40
16. (turn_to satellite3 phenomenon29 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon29)
   goals met: 4 of 40
17. (take_image satellite3 phenomenon29 instrument25 thermograph5)
   added: (have_image phenomenon29 thermograph5)
   goals met: 5 of 40
18. (turn_to satellite3 phenomenon32 phenomenon29)
   deleted: (pointing satellite3 phenomenon29)
   added: (pointing satellite3 phenomenon32)
   goals met: 5 of 40
19. (take_image satellite3 phenomenon32 instrument25 spectrograph2)
   added: (have_image phenomenon32 spectrograph2)
   goals met: 6 of 40
20. (take_image satellite3 phenomenon32 instrument25 thermograph5)
   added: (have_image phenomenon32 thermograph5)
   goals met: 7 of 40
21. (turn_to satellite3 phenomenon33 phenomenon32)
   deleted: (pointing satellite3 phenomenon32)
   added: (pointing satellite3 phenomenon33)
   goals met: 7 of 40
22. (take_image satellite3 phenomenon33 instrument25 spectrograph2)
   added: (have_image phenomenon33 spectrograph2)
   goals met: 8 of 40
23. (turn_to satellite3 phenomenon36 phenomenon33)
   deleted: (pointing satellite3 phenomenon33)
   added: (pointing satellite3 phenomenon36)
   goals met: 8 of 40
24. (take_image satellite3 phenomenon36 instrument25 thermograph5)
   added: (have_image phenomenon36 thermograph5)
   goals met: 9 of 40
25. (switch_on instrument11 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument11)
   goals met: 9 of 40
26. (calibrate satellite1 instrument11 star9)
   added: (calibrated instrument11)
   goals met: 9 of 40
27. (turn_to satellite1 phenomenon36 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon36)
   goals met: 9 of 40
28. (take_image satellite1 phenomenon36 instrument11 thermograph7)
   added: (have_image phenomenon36 thermograph7)
   goals met: 10 of 40
29. (turn_to satellite2 phenomenon37 phenomenon24)
   deleted: (pointing satellite2 phenomenon24)
   added: (pointing satellite2 phenomenon37)
   goals met: 10 of 40
30. (take_image satellite2 phenomenon37 instrument16 infrared3)
   added: (have_image phenomenon37 infrared3)
   goals met: 11 of 40
31. (turn_to satellite3 phenomenon37 phenomenon36)
   deleted: (pointing satellite3 phenomenon36)
   added: (pointing satellite3 phenomenon37)
   goals met: 11 of 40
32. (take_image satellite3 phenomenon37 instrument25 thermograph5)
   added: (have_image phenomenon37 thermograph5)
   goals met: 12 of 40
33. (turn_to satellite3 phenomenon38 phenomenon37)
   deleted: (pointing satellite3 phenomenon37)
   added: (pointing satellite3 phenomenon38)
   goals met: 12 of 40
34. (take_image satellite3 phenomenon38 instrument25 image0)
   added: (have_image phenomenon38 image0)
   goals met: 13 of 40
35. (turn_to satellite4 phenomenon38 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon38)
   goals met: 13 of 40
36. (take_image satellite4 phenomenon38 instrument26 thermograph6)
   added: (have_image phenomenon38 thermograph6)
   goals met: 14 of 40
37. (turn_to satellite1 phenomenon39 phenomenon36)
   deleted: (pointing satellite1 phenomenon36)
   added: (pointing satellite1 phenomenon39)
   goals met: 14 of 40
38. (take_image satellite1 phenomenon39 instrument11 thermograph7)
   added: (have_image phenomenon39 thermograph7)
   goals met: 15 of 40
39. (turn_to satellite3 phenomenon40 phenomenon38)
   deleted: (pointing satellite3 phenomenon38)
   added: (pointing satellite3 phenomenon40)
   goals met: 15 of 40
40. (take_image satellite3 phenomenon40 instrument25 spectrograph2)
   added: (have_image phenomenon40 spectrograph2)
   goals met: 16 of 40
41. (turn_to satellite4 phenomenon40 phenomenon38)
   deleted: (pointing satellite4 phenomenon38)
   added: (pointing satellite4 phenomenon40)
   goals met: 16 of 40
42. (take_image satellite4 phenomenon40 instrument26 thermograph6)
   added: (have_image phenomenon40 thermograph6)
   goals met: 17 of 40
43. (turn_to satellite4 phenomenon45 phenomenon40)
   deleted: (pointing satellite4 phenomenon40)
   added: (pointing satellite4 phenomenon45)
   goals met: 17 of 40
44. (take_image satellite4 phenomenon45 instrument26 thermograph6)
   added: (have_image phenomenon45 thermograph6)
   goals met: 18 of 40
45. (turn_to satellite2 phenomenon46 phenomenon37)
   deleted: (pointing satellite2 phenomenon37)
   added: (pointing satellite2 phenomenon46)
   goals met: 18 of 40
46. (take_image satellite2 phenomenon46 instrument16 spectrograph1)
   added: (have_image phenomenon46 spectrograph1)
   goals met: 19 of 40
47. (turn_to satellite3 phenomenon46 phenomenon40)
   deleted: (pointing satellite3 phenomenon40)
   added: (pointing satellite3 phenomenon46)
   goals met: 19 of 40
48. (take_image satellite3 phenomenon46 instrument25 thermograph5)
   added: (have_image phenomenon46 thermograph5)
   goals met: 20 of 40
49. (turn_to satellite3 planet22 phenomenon46)
   deleted: (pointing satellite3 phenomenon46)
   added: (pointing satellite3 planet22)
   goals met: 20 of 40
50. (take_image satellite3 planet22 instrument25 spectrograph2)
   added: (have_image planet22 spectrograph2)
   goals met: 21 of 40
51. (turn_to satellite4 planet22 phenomenon45)
   deleted: (pointing satellite4 phenomenon45)
   added: (pointing satellite4 planet22)
   goals met: 21 of 40
52. (take_image satellite4 planet22 instrument26 thermograph6)
   added: (have_image planet22 thermograph6)
   goals met: 22 of 40
53. (turn_to satellite2 planet26 phenomenon46)
   deleted: (pointing satellite2 phenomenon46)
   added: (pointing satellite2 planet26)
   goals met: 22 of 40
54. (take_image satellite2 planet26 instrument16 infrared3)
   added: (have_image planet26 infrared3)
   goals met: 23 of 40
55. (take_image satellite2 planet26 instrument16 spectrograph1)
   added: (have_image planet26 spectrograph1)
   goals met: 24 of 40
56. (switch_on instrument32 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument32)
   goals met: 24 of 40
57. (turn_to satellite5 planet28 phenomenon20)
   deleted: (pointing satellite5 phenomenon20)
   added: (pointing satellite5 planet28)
   goals met: 24 of 40
58. (turn_to satellite5 star13 planet28)
   deleted: (pointing satellite5 planet28)
   added: (pointing satellite5 star13)
   goals met: 24 of 40
59. (calibrate satellite5 instrument32 star13)
   added: (calibrated instrument32)
   goals met: 24 of 40
60. (turn_to satellite5 planet28 star13)
   deleted: (pointing satellite5 star13)
   added: (pointing satellite5 planet28)
   goals met: 24 of 40
61. (take_image satellite5 planet28 instrument32 image4)
   added: (have_image planet28 image4)
   goals met: 25 of 40
62. (turn_to satellite2 planet28 planet26)
   deleted: (pointing satellite2 planet26)
   added: (pointing satellite2 planet28)
   goals met: 25 of 40
63. (take_image satellite2 planet28 instrument16 spectrograph1)
   added: (have_image planet28 spectrograph1)
   goals met: 26 of 40
64. (turn_to satellite2 planet30 planet28)
   deleted: (pointing satellite2 planet28)
   added: (pointing satellite2 planet30)
   goals met: 26 of 40
65. (take_image satellite2 planet30 instrument16 infrared3)
   added: (have_image planet30 infrared3)
   goals met: 27 of 40
66. (turn_to satellite5 planet30 planet28)
   deleted: (pointing satellite5 planet28)
   added: (pointing satellite5 planet30)
   goals met: 27 of 40
67. (take_image satellite5 planet30 instrument32 spectrograph2)
   added: (have_image planet30 spectrograph2)
   goals met: 28 of 40
68. (turn_to satellite3 planet35 planet22)
   deleted: (pointing satellite3 planet22)
   added: (pointing satellite3 planet35)
   goals met: 28 of 40
69. (take_image satellite3 planet35 instrument25 spectrograph2)
   added: (have_image planet35 spectrograph2)
   goals met: 29 of 40
70. (turn_to satellite3 planet42 planet35)
   deleted: (pointing satellite3 planet35)
   added: (pointing satellite3 planet42)
   goals met: 29 of 40
71. (take_image satellite3 planet42 instrument25 spectrograph2)
   added: (have_image planet42 spectrograph2)
   goals met: 30 of 40
72. (turn_to satellite2 planet43 planet30)
   deleted: (pointing satellite2 planet30)
   added: (pointing satellite2 planet43)
   goals met: 30 of 40
73. (take_image satellite2 planet43 instrument16 spectrograph1)
   added: (have_image planet43 spectrograph1)
   goals met: 31 of 40
74. (turn_to satellite3 planet44 planet42)
   deleted: (pointing satellite3 planet42)
   added: (pointing satellite3 planet44)
   goals met: 31 of 40
75. (take_image satellite3 planet44 instrument25 thermograph5)
   added: (have_image planet44 thermograph5)
   goals met: 32 of 40
76. (turn_to satellite4 planet44 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet44)
   goals met: 32 of 40
77. (take_image satellite4 planet44 instrument26 thermograph6)
   added: (have_image planet44 thermograph6)
   goals met: 33 of 40
78. (turn_to satellite5 planet47 planet30)
   deleted: (pointing satellite5 planet30)
   added: (pointing satellite5 planet47)
   goals met: 33 of 40
79. (take_image satellite5 planet47 instrument32 image4)
   added: (have_image planet47 image4)
   goals met: 34 of 40
80. (turn_to satellite5 planet48 planet47)
   deleted: (pointing satellite5 planet47)
   added: (pointing satellite5 planet48)
   goals met: 34 of 40
81. (take_image satellite5 planet48 instrument32 image4)
   added: (have_image planet48 image4)
   goals met: 35 of 40
82. (turn_to satellite2 star23 planet43)
   deleted: (pointing satellite2 planet43)
   added: (pointing satellite2 star23)
   goals met: 35 of 40
83. (take_image satellite2 star23 instrument16 spectrograph1)
   added: (have_image star23 spectrograph1)
   goals met: 36 of 40
84. (turn_to satellite3 star31 planet44)
   deleted: (pointing satellite3 planet44)
   added: (pointing satellite3 star31)
   goals met: 36 of 40
85. (take_image satellite3 star31 instrument25 image0)
   added: (have_image star31 image0)
   goals met: 37 of 40
86. (turn_to satellite3 star34 star31)
   deleted: (pointing satellite3 star31)
   added: (pointing satellite3 star34)
   goals met: 37 of 40
87. (take_image satellite3 star34 instrument25 thermograph5)
   added: (have_image star34 thermograph5)
   goals met: 38 of 40
88. (turn_to satellite2 star41 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 star41)
   goals met: 38 of 40
89. (take_image satellite2 star41 instrument16 infrared3)
   added: (have_image star41 infrared3)
   goals met: 39 of 40
90. (turn_to satellite3 star49 star34)
   deleted: (pointing satellite3 star34)
   added: (pointing satellite3 star49)
   goals met: 39 of 40
91. (take_image satellite3 star49 instrument25 image0)
   added: (have_image star49 image0)
   goals met: 40 of 40
